spec/fixtures/vcr_cassettes/go_cardless_successful_transaction.yml

---
http_interactions:
- request:
    method: get
    uri: https://api-sandbox.gocardless.com/mandates/MD0000PSV8N7FR
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - gocardless_pro/v1.0.3 ruby/2.3.0p0 ruby/2.3.0 x86_64-linux faraday/0.9.1
      Gocardless-Version:
      - '2015-07-06'
      Content-Type:
      - application/json
      Authorization:
      - Bearer <gocardless_token>
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Mon, 09 May 2016 22:07:45 GMT
      Content-Type:
      - application/json
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      Set-Cookie:
      - __cfduid=daba430ee938f5f8340be13fdcb3bac381462831665; expires=Tue, 09-May-17
        22:07:45 GMT; path=/; domain=.gocardless.com; HttpOnly
      Pragma:
      - no-cache
      Cache-Control:
      - no-store
      Etag:
      - W/"ad98d45b0277617fb13beb84d343ea77"
      X-Request-Id:
      - d9ca7fe0-c64e-4300-9a58-48d0d0d5a85e
      Vary:
      - Origin
      X-Xss-Protection:
      - 1; mode=block
      X-Content-Type-Options:
      - nosniff
      Strict-Transport-Security:
      - max-age=31536000; includeSubDomains; preload
      Ratelimit-Limit:
      - '1000'
      Ratelimit-Remaining:
      - '999'
      Ratelimit-Reset:
      - Mon, 09 May 2016 22:08:00 GMT
      Server:
      - cloudflare-nginx
      Cf-Ray:
      - 2a08775357d51ea1-SJC
    body:
      encoding: ASCII-8BIT
      string: '{"mandates":{"id":"MD0000PSV8N7FR","created_at":"2016-04-11T19:16:56.421Z","reference":"OMAR-JMEKNM53MREX3","status":"active","scheme":"bacs","next_possible_charge_date":"2016-05-13","payments_require_approval":false,"metadata":{},"links":{"customer_bank_account":"BA0000P8MREF5F","creditor":"CR000045KKQEY8"}}}'
    http_version: 
  recorded_at: Mon, 09 May 2016 22:07:45 GMT
- request:
    method: post
    uri: https://api-sandbox.gocardless.com/payments
    body:
      encoding: UTF-8
      string: '{"payments":{"amount":1155,"currency":"GBP","links":{"mandate":"MD0000PSV8N7FR"},"metadata":{"customer_id":"CU0000RR39FMVB"},"charge_date":"2016-05-20"}}'
    headers:
      User-Agent:
      - gocardless_pro/v1.0.3 ruby/2.3.0p0 ruby/2.3.0 x86_64-linux faraday/0.9.1
      Gocardless-Version:
      - '2015-07-06'
      Content-Type:
      - application/json
      Authorization:
      - Bearer <gocardless_token>
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 201
      message: Created
    headers:
      Date:
      - Mon, 09 May 2016 22:07:46 GMT
      Content-Type:
      - application/json
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      Set-Cookie:
      - __cfduid=d9c6a961a0a3099ad1b67da67635a38a71462831666; expires=Tue, 09-May-17
        22:07:46 GMT; path=/; domain=.gocardless.com; HttpOnly
      Location:
      - https://api-sandbox.gocardless.com/payments/PM0001A3CHAWJD
      Pragma:
      - no-cache
      Cache-Control:
      - no-store
      Etag:
      - W/"fcf963df7891a1dacb427f8c6c08d15d"
      X-Request-Id:
      - 6111801c-0a0c-4fcd-a590-4fdb92bd727c
      Vary:
      - Origin
      X-Xss-Protection:
      - 1; mode=block
      X-Content-Type-Options:
      - nosniff
      Strict-Transport-Security:
      - max-age=31536000; includeSubDomains; preload
      Ratelimit-Limit:
      - '1000'
      Ratelimit-Remaining:
      - '998'
      Ratelimit-Reset:
      - Mon, 09 May 2016 22:08:00 GMT
      Server:
      - cloudflare-nginx
      Cf-Ray:
      - 2a08775920ad2870-SJC
    body:
      encoding: UTF-8
      string: '{"payments":{"id":"PM0001A3CHAWJD","created_at":"2016-05-09T22:07:46.686Z","charge_date":"2016-05-20","amount":1155,"description":null,"currency":"GBP","status":"pending_submission","amount_refunded":0,"reference":null,"metadata":{"customer_id":"CU0000RR39FMVB"},"links":{"mandate":"MD0000PSV8N7FR","creditor":"CR000045KKQEY8"}}}'
    http_version: 
  recorded_at: Mon, 09 May 2016 22:07:46 GMT
- request:
    method: get
    uri: https://api-sandbox.gocardless.com/customer_bank_accounts/BA0000P8MREF5F
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - gocardless_pro/v1.0.3 ruby/2.3.0p0 ruby/2.3.0 x86_64-darwin14 faraday/0.9.1
      Gocardless-Version:
      - '2015-07-06'
      Content-Type:
      - application/json
      Authorization:
      - Bearer <gocardless_token>
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Wed, 08 Jun 2016 21:42:45 GMT
      Content-Type:
      - application/json
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      Set-Cookie:
      - __cfduid=d2da58aaab82c426d0c51d6b86b2454991465422164; expires=Thu, 08-Jun-17
        21:42:44 GMT; path=/; domain=.gocardless.com; HttpOnly
      Pragma:
      - no-cache
      Cache-Control:
      - no-store
      Etag:
      - W/"2c73e1d569064ff106e2377ed61d5700"
      X-Request-Id:
      - 74b75a56-12c8-453a-b765-3d473140650c
      Vary:
      - Origin
      X-Xss-Protection:
      - 1; mode=block
      X-Content-Type-Options:
      - nosniff
      Strict-Transport-Security:
      - max-age=31536000; includeSubDomains; preload
      Ratelimit-Limit:
      - '1000'
      Ratelimit-Remaining:
      - '999'
      Ratelimit-Reset:
      - Wed, 08 Jun 2016 21:43:00 GMT
      Server:
      - cloudflare-nginx
      Cf-Ray:
      - 2aff83f2a4952ec9-MIA
    body:
      encoding: ASCII-8BIT
      string: '{"customer_bank_accounts":{"id":"BA0000P8MREF5F","created_at":"2016-04-11T19:16:56.376Z","account_number_ending":"11","account_holder_name":"S
        SAMWELL","bank_name":"BARCLAYS BANK PLC","currency":"GBP","country_code":"GB","metadata":{},"enabled":true,"links":{"customer":"CU0000RR39FMVB"}}}'
    http_version: 
  recorded_at: Wed, 08 Jun 2016 21:42:45 GMT
recorded_with: VCR 3.0.0
